app/controllers/elections_controller.rb

SELECT "elections".* FROM "elections"
---
  def index
    @elections = Election.all

INSERT INTO "elections" ("name", "ownerDID", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Election 1"], ["ownerDID", "asdflj234234"], ["created_at", "2023-06-08 17:14:19.122501"], ["updated_at", "2023-06-08 17:14:19.122501"]]
---
  def create
    @election = Election.new(election_params)

    respond_to do |format|
      if @election.save

SELECT "elections".* FROM "elections" WHERE "elections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_election
      @election = Election.find(params[:id])